{
  "version": "1.0.0",
  "description": "Ego Strengthening Configuration - Based on Hartland's classic approach, modernized",
  
  "modes": {
    "cascade": {
      "description": "Benefit Cascade pattern - paint scenes and suggest experiences, not causal explanations",
      "placement": "Near end, after main therapeutic work, before emergence",
      "target_words": [150, 250],
      "approach": "SCENE-SETTING over explanation. Paint vivid moments client can step into.",
      "structure": {
        "anchor_future": "Imagine it now. [First change happening]",
        "build_chains": "Paint vivid scenes with sensory details, not causal explanations",
        "acknowledge_momentum": "One small shift creating the next",
        "tie_outcome": "Until you find yourself living exactly what you came here for: [desiredOutcome]",
        "anchor_present": "This isn't hope. This is the natural cascade of change already beginning in your body right now"
      },
      "language_style": {
        "prefer": "Scene-setting, experiential, vivid sensory moments",
        "avoid": "Causal explanations, 'because' statements, logical reasoning",
        "examples": {
          "avoid_explanatory": "Your sleep becomes more restorative because your nervous system knows how to rest",
          "use_experiential": "And tonight, when you lay your head down, you might notice your body settling more quickly into rest, your mind releasing the day with each exhale, sleep finding you the way it did when you were young"
        }
      },
      "connecting_phrases": [
        "And tonight, when...",
        "You might notice...",
        "Perhaps tomorrow...",
        "With each [action], [sensation]...",
        "Until [desired state]...",
        "Somewhere in...",
        "Next time you...",
        "In moments when...",
        "Even as...",
        "Your body already...",
        "Sleep finding you...",
        "Energy returning...",
        "That feeling of..."
      ],
      "variation_rules": [
        "VARY sentence openers - max 2 consecutive 'And...' starts",
        "Mix temporal markers (tonight, tomorrow, next time)",
        "Alternate between 'you might' and action-first structures",
        "Use nostalgic callbacks sparingly ('the way it used to be', 'like you remember')"
      ],
      "sensory_elements": [
        "Physical sensations (settling, releasing, softening)",
        "Temporal markers (tonight, tomorrow, next time)",
        "Gentle observations (you might notice, perhaps you find)",
        "Vivid imagery (sleep finding you, day releasing)",
        "Nostalgic callbacks (the way it used to be, like you remember)"
      ],
      "rules": [
        "PAINT SCENES, don't explain causality",
        "Use sensory details (settling, releasing, flowing)",
        "Include temporal markers (tonight, tomorrow, next time)",
        "Create moments client can experience, not understand",
        "USE ALL submitted benefits but weave into experiential narrative",
        "Tie all scenes to client's desiredOutcome field"
      ]
    },
    "chunk": {
      "description": "Meaningful 150-250 word segment for script ending",
      "target_words": [150, 250],
      "style": "Hartland-inspired, layered improvements"
    },
    "standalone": {
      "description": "Full ego strengthening script",
      "target_words": [1200, 1800],
      "structure": {
        "opening": "200-300 words",
        "core": "800-1000 words", 
        "integration": "200-300 words",
        "emergence": "100-200 words"
      }
    }
  },
  
  "emergence_styles": {
    "wake": {
      "tone": "Energizing, forward-looking, activating",
      "tense": "Present progressive (becoming stronger, growing clearer)",
      "time_reference": "Day ahead (as you move through today)",
      "emphasis": ["energy", "clarity", "confidence", "alertness"]
    },
    "sleep": {
      "tone": "Calming, settling, restorative",
      "tense": "Gentle present (your body healing, sleep deepening)",
      "time_reference": "Night (as you rest tonight, through the night)",
      "emphasis": ["restoration", "peace", "replenishment", "healing"]
    }
  },
  
  "functional_categories": {
    "note": "SELECT 3-5 TOTAL. Use EXPERIENTIAL scene-setting, not explanatory statements.",
    
    "physical_restoration": {
      "description": "Body healing, immune system, physical strength",
      "experiential_examples": [
        "And you might notice, in the days ahead, your body remembering how to heal itself, the way it always has, cells renewing while you rest",
        "Perhaps tomorrow, or the next day, you find yourself standing a little taller, breathing a little deeper, strength returning like an old friend",
        "And with each night of rest, your body doing what it knows how to do, restoring itself quietly, completely"
      ],
      "avoid_explanatory": [
        "Your body healing and replenishing completely because it knows how",
        "Immune system strengthening naturally as a result of deep rest"
      ],
      "wake_emphasis": "Energy, strength, vitality",
      "sleep_emphasis": "Healing, restoration, replenishment"
    },
    
    "sleep_quality": {
      "description": "Sleep depth, rest quality, restorative sleep",
      "experiential_examples": [
        "And tonight, when you lay your head down, you might notice your body settling more quickly into rest, your mind releasing the day with each exhale",
        "Sleep finding you the way it did when you were young, naturally, easily, your whole being softening into the rhythm of night",
        "Perhaps you'll discover yourself waking tomorrow more refreshed, the kind of rest that used to come so easily now returning"
      ],
      "avoid_explanatory": [
        "Your sleep deepening night after night because your nervous system knows rest",
        "Rest becoming more restorative as a result of these changes"
      ],
      "when_to_use": "Sleep emergence type or insomnia-related issues"
    },
    
    "cognitive_enhancement": {
      "description": "Memory, focus, mental clarity, concentration",
      "experiential_examples": [
        "And tomorrow, when you reach for that word, that memory, you might find it there waiting, clear and easy, the way it used to be",
        "Perhaps next time you sit down to focus, you'll notice the fog lifting, thoughts flowing with a clarity that surprises you",
        "Your mind organizing itself while you rest, so that tomorrow, ideas connect effortlessly, decisions coming with ease"
      ],
      "avoid_explanatory": [
        "Memory becoming clearer because your mind is rested",
        "Focus sharpening as a result of better sleep quality"
      ],
      "wake_emphasis": "Clarity, focus, sharpness",
      "sleep_emphasis": "Mind settling, thoughts calming"
    },
    
    "energy_vitality": {
      "description": "Energy levels, vitality, aliveness",
      "experiential_examples": [
        "And you might wake tomorrow with that feeling you remember, energy flowing naturally through your day, not forced, just there",
        "Perhaps next week, or the week after, you find yourself saying yes to things you've been too tired for, life calling you forward again",
        "That vitality you used to know, returning like spring after winter, gentle at first, then undeniable"
      ],
      "avoid_explanatory": [
        "Your energy replenishing completely because your body is healing",
        "Vitality returning as a result of better rest"
      ],
      "when_to_use": "Wake emergence type, fatigue-related issues"
    },
    
    "stress_response": {
      "description": "Nervous system regulation, calm, stress management",
      "experiential_examples": [
        "And next time something stressful happens, you might notice your body responding differently, a calm you didn't have to reach for, just there",
        "Your nervous system learning what it feels like to be safe, really safe, carrying that knowing into your days, into your nights",
        "Perhaps tomorrow, in a moment that used to spike anxiety, you'll find yourself steady, your breath even, your body remembering peace"
      ],
      "avoid_explanatory": [
        "Your nervous system learning deeper calm because of this work",
        "Stress response becoming balanced as a result of regulation"
      ],
      "universal": true,
      "note": "Appropriate for both wake and sleep"
    },
    
    "emotional_wellbeing": {
      "description": "Emotional stability, calm, resilience",
      "experiential_examples": [
        "And in moments that used to shake you, you might notice yourself staying steady, like a tree in wind, bending but not breaking",
        "That peace you've been searching for, settling into your chest, your shoulders, becoming something you carry with you",
        "Perhaps next time emotions rise, you'll find yourself watching them pass, the way clouds move across sky, without being swept away"
      ],
      "avoid_explanatory": [
        "Emotions becoming steadier because you're learning regulation",
        "Inner calm growing stronger as a result of this practice"
      ],
      "hartland_inspired": true
    },
    
    "confidence_self_reliance": {
      "description": "Self-confidence, independence, inner strength",
      "experiential_examples": [
        "And you might surprise yourself soon, speaking up when you used to stay quiet, your voice steady, your knowing clear",
        "That feeling of trusting yourself, the way you did before doubt crept in, returning now, solid as ground beneath your feet",
        "Perhaps in a moment of decision, you'll find yourself choosing without second-guessing, your inner compass pointing true"
      ],
      "avoid_explanatory": [
        "Confidence in yourself growing stronger because you're healing",
        "Trusting your own judgment more as a result of this work"
      ],
      "hartland_inspired": true,
      "wake_emphasis": "Confidence, capability, strength"
    }
  },
  
  "hartland_principles": {
    "description": "Core patterns from Hartland's classic approach",
    
    "rhythmic_building": {
      "pattern": "Every day...",
      "purpose": "Creates momentum and expectation",
      "examples": [
        "Every day you become stronger...",
        "Every day your mind grows clearer...",
        "Every day you feel more confident..."
      ]
    },
    
    "contrast_structure": {
      "pattern": "Much more... much less...",
      "purpose": "Defines change through opposition",
      "examples": [
        "Much more calm, much less agitated",
        "Much more confident, much less doubtful",
        "Much more energized, much less tired"
      ]
    },
    
    "experiential_flow": {
      "pattern": "And as [moment], [experience]... / With that [sensation], [deeper benefit]...",
      "purpose": "Creates flowing cascade of experiences, not causal explanations",
      "examples": [
        "And as your body settles, you find yourself standing stronger",
        "With that deep rest comes a feeling you haven't had in years",
        "And somewhere in all this, you notice yourself becoming..."
      ],
      "note": "AVOID 'because', 'as a result', causal language - use temporal/experiential flow"
    },
    
    "permission_framework": {
      "pattern": "Everything you allow into your mind...",
      "purpose": "Establishes consent and receptivity",
      "examples": [
        "Everything you allow sinks deeply...",
        "What you choose to accept becomes...",
        "These truths you welcome create..."
      ]
    }
  },
  
  "integration_patterns": {
    "metaphor_tie": {
      "description": "Connect ego strengthening to script metaphor",
      "template": "Like the [METAPHOR], your [IMPROVEMENT]...",
      "examples": [
        "Like the ocean finding its rhythm, your nervous system remembers calm",
        "Like the mountain standing firm, your confidence grows stronger",
        "Like the garden healing itself, your body knows exactly what to do"
      ]
    },
    
    "narrative_weave": {
      "description": "Blend into story without breaking flow",
      "rules": [
        "1-2 sentences MAX per statement",
        "Then immediately return to main narrative",
        "Use transitional phrases: 'And as you...' 'Even as...' 'While...'"
      ]
    }
  },
  
  "experiential_cascades": {
    "description": "Scene-based benefit flows - paint moments, not explain logic",
    "approach": "Show the experience unfolding, not why it happens",
    
    "physical_cascade": {
      "scene_examples": [
        "And tonight, as your body settles into deeper rest, you might notice something shifting. Perhaps tomorrow morning, when your feet touch the floor, there's energy you haven't felt in months. And with that energy, you find yourself saying yes to a walk, to movement, to life calling you back",
        "Your shoulders releasing tension they've carried for years. And as they soften, your breath deepens, fuller than it's been. And with that breath, your whole system remembering what ease feels like, healing happening in ways you can't see but will certainly feel"
      ],
      "avoid_logical": [
        "Sleep quality leads to energy which increases activity level",
        "Stress reduction causes immune function to improve resulting in better health"
      ]
    },
    
    "mental_cognitive_cascade": {
      "scene_examples": [
        "And tomorrow, when you sit down to work, you might notice the fog isn't quite as thick. Your thoughts connecting like they used to, one idea leading naturally to the next. And with that clarity, decisions coming easier, the path forward revealing itself",
        "Perhaps next week, you'll reach for a word and it will be there, waiting. And with that memory returning, your confidence building, until you find yourself in conversations you've been avoiding, your mind sharp, present, fully there"
      ],
      "avoid_logical": [
        "Mental clarity leads to better decisions which improve outcomes",
        "Reduced fog causes sharper focus resulting in enhanced performance"
      ]
    },
    
    "emotional_psychological_cascade": {
      "scene_examples": [
        "And you might notice yourself standing a little taller tomorrow. Not forcing it, just... there. And when someone asks too much, you'll hear yourself say no, clear and kind. And with that boundary, space opening up, relationships deepening in ways that surprise you",
        "That inner peace you've been seeking, settling into your bones. And with it, you find yourself present in moments you used to miss, really there with the people you love, connection flowing naturally again"
      ],
      "avoid_logical": [
        "Self-worth creates healthy boundaries which lead to better relationships",
        "Confidence drives action-taking resulting in results creating more confidence"
      ]
    },
    
    "behavioral_cascade": {
      "scene_examples": [
        "And you might take one small step tomorrow. Nothing dramatic, just... one thing. And with that one thing, momentum building, until next week you're doing things that seemed impossible today, the change so natural you almost don't notice it happening",
        "Perhaps you'll catch yourself doing that new thing without thinking about it. And then again the next day. And somewhere in that repetition, you realize you've become the kind of person who does this, the identity shift so subtle it feels like it was always you"
      ],
      "avoid_logical": [
        "Small action creates momentum leading to bigger actions and results",
        "New habit drives consistency causing identity shift resulting in sustainable change"
      ]
    },
    
    "relational_cascade": {
      "scene_examples": [
        "And next time tension rises, you might notice yourself breathing instead of reacting. And in that breath, space opening. And in that space, words coming that actually help, your relationships shifting in ways you've wanted for years",
        "Perhaps you'll notice people responding to you differently. Not because you're trying, but because something in you has changed. And with that change, the right people drawing closer, connections deepening into something real"
      ],
      "avoid_logical": [
        "Calm presence leads to better communication resulting in relationship depth",
        "Self-regulation causes responding vs reacting creating healthier dynamics"
      ]
    }
  },
  
  "quality_rules": {
    "distribution": {
      "max_keywords_per_paragraph": 3,
      "max_total_keywords": 10,
      "keywords": [
        "sleep", "immune", "memory", "energy", "clarity", "focus",
        "healing", "replenish", "strengthen", "deepen", "improv",
        "restor", "vitality", "nervous system", "calm", "stress",
        "confident", "clear", "strong"
      ]
    },
    
    "statement_rules": {
      "max_sentences_per_statement": 2,
      "avoid_dumps": "Never list benefits in paragraph form",
      "spacing": "Space naturally throughout narrative flow"
    }
  }
}
