{
  "version": "1.0.0",
  "arcs": [
    {
      "id": "effortlessness",
      "name": "Effortlessness of Change",
      "description": "Change is natural when we remove blocks, not effortful when we push",
      "core_message": "Change happens naturally when obstacles are removed, like water finding its path",
      "when_to_use": ["always", "foundation"],
      "presenting_issues": ["resistance", "trying too hard", "forcing change", "burnout"],
      "key_language": [
        "As naturally as breath",
        "Effortlessly, the way your body heals a cut",
        "Without trying, without forcing",
        "Change happens when we get out of its way",
        "Like water flowing around obstacles",
        "Your body knows how to do this"
      ],
      "prompt_integration": "Emphasize that change is a natural unfolding, not something that requires effort or force. Use metaphors of natural processes (healing, growth, water flowing)."
    },
    {
      "id": "re-minding",
      "name": "Re-Minding (Not Learning)",
      "description": "The brain has been in peaceful states before - we're RE-MINDING it",
      "core_message": "You're not learning something new; you're remembering what you already know",
      "when_to_use": ["always", "removes pressure of learning"],
      "presenting_issues": ["performance anxiety", "learning pressure", "fear of failure"],
      "key_language": [
        "Your body remembers how to feel at peace",
        "Some part of you has always known this",
        "You're accessing a state you've been in before",
        "Re-minding yourself of what you already know",
        "This feeling isn't new - it's a return",
        "Your system remembers this state"
      ],
      "prompt_integration": "Frame all suggestions as remembering or returning to a known state, not acquiring something new. Emphasize recognition over learning."
    },
    {
      "id": "two-tempos",
      "name": "Two Tempos of Change",
      "description": "Change can be sudden (bursting) or gradual (slow growth) - both valid",
      "core_message": "Honor whatever tempo of change feels right for you",
      "when_to_use": ["always", "gives permission for any pace"],
      "presenting_issues": ["impatience", "frustration with progress", "comparison", "timeline pressure"],
      "variations": {
        "bursting": {
          "name": "The Bursting (Flower Bud)",
          "description": "Sudden transformation, ready to bloom",
          "language": [
            "Like a flower bud that's been preparing, ready to bloom in an instant",
            "All the work has been done beneath the surface, and now...",
            "Sometimes change happens in a moment of recognition",
            "The breakthrough that's been building, ready to emerge"
          ]
        },
        "slow_growth": {
          "name": "The Slow Growth (Seed Underground)",
          "description": "Gradual change, invisible work beneath the surface",
          "language": [
            "Like a seed growing beneath the soil - invisible work until breakthrough",
            "Patient, steady change building beneath awareness",
            "Trust the process even when you can't see the growth",
            "Each day, small shifts accumulating"
          ]
        }
      },
      "key_language": [
        "Change in its own time - sometimes sudden, sometimes gradual, always natural",
        "Your body knows the tempo that's right for you",
        "Fast or slow, both are perfect",
        "The wisdom to unfold at exactly the right pace"
      ],
      "prompt_integration": "Include both possibilities - sudden shift and gradual change. Give explicit permission for whatever tempo emerges naturally."
    },
    {
      "id": "recognition-ego-strengthening",
      "name": "Recognition Ego Strengthening",
      "description": "You are MORE than you realize - recognition, not inflation",
      "core_message": "Recognizing the power, capacity, and wholeness that's always been there",
      "when_to_use": ["confidence issues", "self-worth", "empowerment", "imposter syndrome"],
      "presenting_issues": ["low self-esteem", "imposter syndrome", "self-doubt", "lack of confidence"],
      "key_language": [
        "You are more powerful than you've been letting yourself remember",
        "More wonderful, more capable than you've allowed yourself to recognize",
        "Not becoming something new - recognizing what's always been true",
        "The strength that's always been yours",
        "Your inherent capacity, simply covered over",
        "The truth of your capability, waiting to be recognized"
      ],
      "prompt_integration": "Frame ego strengthening as recognition of existing qualities, not creation of new ones. Use 'recognize' and 'remember' language, not 'become' or 'develop'."
    },
    {
      "id": "relief-to-new-life",
      "name": "Relief → Inspiration → New Life",
      "description": "The transformation sequence from weight to freedom",
      "core_message": "As weight lifts, energy returns, and new possibilities open",
      "when_to_use": ["major transformation", "life changes", "breakthrough work"],
      "presenting_issues": ["feeling stuck", "carrying burdens", "exhaustion", "seeking life change"],
      "transformation_sequence": [
        {
          "stage": "weight",
          "description": "Acknowledge the burden at all levels",
          "language": "The weight you've been carrying - physically, emotionally, mentally, spiritually"
        },
        {
          "stage": "lifting",
          "description": "Release of emotional baggage and limiting beliefs",
          "language": "As that weight begins to lift, emotional baggage releasing, old beliefs dissolving"
        },
        {
          "stage": "energy_returns",
          "description": "Reclaim the energy that was bound up",
          "language": "And you feel energy returning - energy that was always yours, now freed up, available"
        },
        {
          "stage": "inspiration",
          "description": "New possibilities become visible",
          "language": "Relief becomes inspiration, new possibilities opening before you"
        },
        {
          "stage": "new_life",
          "description": "Living from authentic self",
          "language": "Inspiration becomes new life, living from your authentic self, your true nature"
        }
      ],
      "key_language": [
        "As that weight lifts, you feel energy returning",
        "Energy that was always yours, now freed up",
        "Relief becomes inspiration. Inspiration becomes new life.",
        "The natural sequence of transformation unfolding"
      ],
      "prompt_integration": "Follow the 5-stage sequence: Weight → Lifting → Energy Returns → Inspiration → New Life. Emphasize that energy returns (not created), and transformation is natural unfolding."
    },
    {
      "id": "emotional-physical-chain",
      "name": "Emotions Create Physical Tension",
      "description": "Clear emotions, release tension, return to true self",
      "core_message": "Unprocessed emotions create physical tension; releasing them reveals who you've always been",
      "when_to_use": ["anxiety", "physical tension", "stuck emotions", "trauma healing"],
      "presenting_issues": ["anxiety", "tension", "stuck feelings", "body armoring", "trauma"],
      "chain_sequence": [
        "Unprocessed emotions (fear, shame, grief)",
        "Physical tension in body",
        "Hesitation, stuckness, lack of confidence",
        "Isolation",
        "False narratives and stories"
      ],
      "reversal_sequence": [
        "Acknowledge the emotions",
        "Allow them to move and release",
        "Feel physical tension softening",
        "Confidence and ease returning",
        "Connection restored",
        "True story revealed"
      ],
      "key_language": [
        "These layers of protection served you once. Now we're gently removing what you no longer need.",
        "Returning to who you've always been underneath the armor",
        "Not becoming someone new. Remembering who you are.",
        "As emotions clear, tension releases, and you return to yourself",
        "The real you, beneath the protective layers"
      ],
      "prompt_integration": "Frame tension as protective armor, not pathology. Emphasize gentle release and return to authentic self beneath the protection."
    },
    {
      "id": "brain-master-skill",
      "name": "Brain's Master Skill: Forgetting & Learning",
      "description": "The same skill that learned the problem can learn the solution",
      "core_message": "Your brain is masterful at both forgetting and learning - use that power",
      "when_to_use": ["habit change", "neural rewiring", "overcoming patterns"],
      "presenting_issues": ["bad habits", "unwanted patterns", "automatic responses", "conditioning"],
      "key_language": [
        "Your brain is a master at forgetting what no longer serves and learning something new",
        "The same skill that learned fear can learn peace",
        "Forgetting is as natural as learning",
        "Your brain does this automatically - let it work for you",
        "The mechanism that created the pattern can create a new one"
      ],
      "prompt_integration": "Reframe brain's capacity to form habits as a feature, not a bug. The same neuroplasticity that learned unwanted patterns can learn desired ones."
    },
    {
      "id": "mind-body-unity",
      "name": "Mind-Body Unity",
      "description": "Mind and body are one system - changing one changes the other",
      "core_message": "Your mind and body are unified. A shift in one creates a shift in the other.",
      "when_to_use": ["psychosomatic issues", "chronic pain", "stress-related symptoms"],
      "presenting_issues": ["chronic pain", "tension headaches", "stress symptoms", "psychosomatic issues"],
      "key_language": [
        "Your mind and body speak the same language",
        "As your thoughts shift, your body responds",
        "What changes in the mind, changes in the body",
        "One system, deeply connected, working together",
        "The body hears what the mind believes",
        "Unified, whole, responsive to your intention"
      ],
      "prompt_integration": "Emphasize the bidirectional relationship between mind and body. Show how mental/emotional shifts naturally create physical changes and vice versa."
    },
    {
      "id": "parts-integration",
      "name": "Parts Integration",
      "description": "All parts of you want the same thing - safety and wellbeing",
      "core_message": "Even conflicting parts share a common goal when we look beneath the surface",
      "when_to_use": ["internal conflict", "self-sabotage", "conflicting desires"],
      "presenting_issues": ["self-sabotage", "inner conflict", "ambivalence", "part of me wants/part of me doesn't"],
      "key_language": [
        "Every part of you, even the ones that seem to conflict, wants your wellbeing",
        "The part that resists and the part that wants change - both protecting you",
        "When we listen to all parts, integration becomes natural",
        "No part is the enemy. Each has wisdom to offer.",
        "Beneath the conflict, a shared desire for your safety and happiness",
        "All parts coming together, aligned in their true purpose"
      ],
      "prompt_integration": "Validate all parts as having positive intent. Frame integration as recognition of shared goals, not elimination of parts. Use dialogue between parts to find common ground."
    },
    {
      "id": "future-self",
      "name": "Future Self Connection",
      "description": "Your future self is already there, calling you forward",
      "core_message": "Connect with the version of you who has already made this transformation",
      "when_to_use": ["goal achievement", "identity shifts", "major transitions"],
      "presenting_issues": ["uncertainty about future", "lacking direction", "identity confusion", "major life decisions"],
      "key_language": [
        "Imagine the you who has already made this change, looking back with wisdom",
        "Your future self is already there, waiting, beckoning you forward",
        "Step into the experience of being that version of you",
        "What does your future self know that you're beginning to remember now?",
        "From that future place, looking back, what wisdom arises?",
        "The path illuminated by the one who's already walked it - you"
      ],
      "prompt_integration": "Use temporal perspective shifting to access resourceful future states. Have client experience themselves as already transformed, then bring that wisdom back to present."
    },
    {
      "id": "inner-wisdom",
      "name": "Inner Wisdom Access",
      "description": "Deep within, you know what you need - we're creating space to hear it",
      "core_message": "The answers are within you. We're simply quieting the noise so you can hear them.",
      "when_to_use": ["decision making", "confusion", "seeking clarity"],
      "presenting_issues": ["confusion", "indecision", "seeking answers", "lost direction"],
      "key_language": [
        "Beneath the noise, a quiet knowing",
        "Your inner wisdom has been there all along",
        "In the stillness, your truth becomes clear",
        "The part of you that already knows, waiting to be heard",
        "Wisdom rising from within, clear and certain",
        "You've always known. Now you're ready to hear it."
      ],
      "prompt_integration": "Create deep receptive states for inner wisdom to emerge. Use minimal guidance - more space for client's own knowing to surface. Frame therapist as facilitator, not source of answers."
    },
    {
      "id": "sensory-amplification",
      "name": "Sensory Amplification",
      "description": "What we notice grows stronger - amplify the desired state through sensory detail",
      "core_message": "The more vividly you experience something, the more real it becomes",
      "when_to_use": ["strengthening positive states", "creating new experiences", "embodiment work"],
      "presenting_issues": ["weak motivation", "difficulty feeling positive states", "disconnection from experience"],
      "key_language": [
        "Notice how that feels in your body - really notice",
        "And as you pay attention to that sensation, it grows stronger",
        "What do you see? What do you hear? What do you feel?",
        "The more you notice, the more vivid it becomes",
        "Amplifying that experience with each breath",
        "Rich, detailed, alive - growing with your attention"
      ],
      "prompt_integration": "Guide detailed sensory exploration of desired states. Layer sensory modalities (visual, kinesthetic, auditory) to deepen experience. What's noticed becomes amplified."
    },
    {
      "id": "resource-activation",
      "name": "Resource Activation",
      "description": "You have resources you haven't fully accessed - let's activate them",
      "core_message": "Strengths, skills, and capacities you already possess, now fully available",
      "when_to_use": ["building confidence", "facing challenges", "empowerment"],
      "presenting_issues": ["feeling inadequate", "facing challenges", "need for strength", "overwhelm"],
      "key_language": [
        "Accessing resources you already have but perhaps haven't fully used",
        "Strengths that are yours, now fully available",
        "Every experience of resilience, every moment of courage - accessible now",
        "Your inner resources, activated and ready",
        "Capacity you've built over a lifetime, available in this moment",
        "Not creating something new - activating what's already yours"
      ],
      "prompt_integration": "Guide recall and activation of past resources (times of strength, courage, resilience). Anchor these resources in body. Make them portable and accessible for future use."
    },
    {
      "id": "playful-learning",
      "name": "Playful Learning",
      "description": "The play brain structure naturally contains learning - change through curiosity and joy",
      "core_message": "Your brain learns best through play, curiosity, and exploration - not pressure",
      "when_to_use": ["learning blocks", "rigid thinking", "perfectionism", "performance pressure"],
      "presenting_issues": ["perfectionism", "fear of failure", "rigidity", "performance anxiety", "learning pressure", "joylessness", "trying too hard"],
      "key_language": [
        "What if this could be playful? Curious? Light?",
        "Your brain learns naturally through play - that's how you learned everything important",
        "Experimenting, exploring, discovering - no wrong moves, only feedback",
        "The play brain holds the learning brain within it",
        "Lightness in the process, joy in the exploration",
        "Permission to try, to wonder, to play with possibilities",
        "Not performing, but exploring. Not proving, but discovering."
      ],
      "prompt_integration": "Frame change as playful exploration rather than serious work or performance. Emphasize that the brain's play circuits naturally activate learning. Remove pressure by introducing curiosity, experimentation, and permission to 'try things on' without commitment. The play brain structure neurologically contains learning pathways."
    },
    {
      "id": "no-clarity",
      "name": "No Clarity (The Overwhelmed Achiever)",
      "description": "Cut through the chaos and overwhelm to reveal a clear path forward",
      "core_message": "You already have the skills - you just need to see where to point them",
      "when_to_use": ["overwhelm", "confusion", "analysis paralysis", "information overload"],
      "presenting_issues": ["anxiety from lack of direction", "overwhelmed by options", "paralyzed by complexity", "can't see the path", "information overload", "analysis paralysis"],
      "blockage_type": "confusion",
      "dimensional_recipe": {
        "psychological": "HIGH - clear the mental fog, organize thinking",
        "temporal": "MEDIUM - future pacing clear path",
        "perspective": "HIGH - eagle-eye view to see the pattern",
        "somatic": "MEDIUM - calm the anxious nervous system",
        "language": "MEDIUM-HIGH - clarity-focused, organizing",
        "symbolic": "MEDIUM - fog clearing, path emerging"
      },
      "key_language": [
        "The fog clears and you see the path",
        "One step at a time, crystal clear",
        "Cutting through the noise to what matters",
        "Your capable mind organizing naturally",
        "The overwhelm dissolves into clarity",
        "Like clouds parting to reveal the mountain path",
        "Your next step becoming obvious, clear, simple",
        "Anxiety settling as the way forward reveals itself"
      ],
      "prompt_integration": "For high achievers paralyzed by options. Emphasize they're not lacking ability - just clarity. Use fog-clearing, path-revealing metaphors. Calm the anxious system while organizing mental clarity. They already know how to succeed - just need to see the direction. Connect to Arc 4 (Recognition - you ARE capable), Arc 1 (Effortlessness - clarity comes naturally), and Arc 11 (Inner Wisdom - you already know what matters)."
    },
    {
      "id": "earned-delight",
      "name": "The Stuck (Earned Delight Model)",
      "description": "When you know what to do but can't do it - delight the brain with earned satisfaction",
      "core_message": "Your brain isn't broken - it's seeking delight. Feed it with earned satisfaction, not food",
      "when_to_use": ["weight loss", "consistency challenges", "know but can't do", "willpower depletion"],
      "presenting_issues": ["weight loss struggles", "can see goal but path too hard", "know what to do but can't do it", "traditional discipline fails", "seeking pleasure from food", "brain depleted and seeking delight"],
      "blockage_type": "depletion",
      "dimensional_recipe": {
        "psychological": "HIGH - reframe discipline as delight-generator",
        "somatic": "HIGH - body sensations of satisfaction vs food",
        "relational": "HIGH - relationship with joy, pleasure, satisfaction",
        "temporal": "MEDIUM - future pacing satisfied life",
        "symbolic": "MEDIUM-HIGH - filling the cup, brain food metaphors"
      },
      "key_language": [
        "Fulfilled, full-filled with life satisfaction",
        "Delighting your brain with earned satisfaction",
        "Brain food - not actual food",
        "When your brain is delighted, you forget about food",
        "Discipline creates satisfaction, satisfaction fills you up",
        "Your brain seeking delight, finding it in life not food",
        "Small wins generating deep satisfaction",
        "Filled up with accomplishment, connection, meaning",
        "The pleasure of earned delight, lasting and real"
      ],
      "earned_delight_sequence": [
        "Use discipline minimally (as little as possible)",
        "Discipline generates satisfaction (not suffering)",
        "Satisfaction fills you up (fulfilled, full-filled)",
        "Brain gets delighted (brain food, not actual food)",
        "When brain is delighted, food cravings disappear (unless actually hungry)"
      ],
      "prompt_integration": "For people who can see the goal but path seems too painful. NOT a willpower problem - brain is seeking satisfaction/delight and only knows food as reliable source. Reframe discipline as delight-generator. Emphasize: minimal discipline → creates satisfaction → fills them up → brain delighted → cravings disappear. Use 'fulfilled' (full-filled), 'satisfied' (from life not food), 'delighting the brain' (brain food), 'earned delight'. Connect to Arc 5 (Relief → Inspiration → New Life as they fill up), Arc 2 (Re-Minding - brain remembers satisfaction from life)."
    },
    {
      "id": "oasis-rest",
      "name": "Flat Tire (Oasis Rest Stop)",
      "description": "Permission to rest without guilt - you're at an oasis, not broken down",
      "core_message": "You're not stuck or broken - you're resting exactly where you need to be",
      "when_to_use": ["trauma recovery", "crisis aftermath", "major life disruption", "exhaustion", "burnout"],
      "presenting_issues": ["post-divorce", "death/grief", "serious illness", "addiction recovery", "major trauma", "trying to move when need rest", "exhausted and done", "pressure to keep going"],
      "blockage_type": "exhaustion",
      "dimensional_recipe": {
        "spiritual": "MEDIUM-HIGH - trust in natural timing, divine rest",
        "somatic": "HIGH - deep rest, body repair, nervous system reset",
        "temporal": "LOW - NO future pacing, stay in present rest",
        "psychological": "MEDIUM - reframe rest as healing not failure",
        "language": "LOW - very permissive, no pressure",
        "symbolic": "HIGH - oasis, rest stop, winter/dormancy metaphors"
      },
      "key_language": [
        "Permission to do nothing - consistently",
        "Rest until you're bored",
        "Boredom is safety - not stressed, just safe",
        "The oasis, not the breakdown",
        "Rest until inspired to move",
        "No need to go anywhere or do anything",
        "Your body is resting, not stuck",
        "Like winter - dormant, restoring, preparing",
        "The oasis where you rest completely",
        "Honoring the need to stop, to be still, to restore"
      ],
      "oasis_protocol": [
        "Permission to do NOTHING - consistently, over and over",
        "Rest until BORED (boredom = not stressed = good sign)",
        "Honor boredom (it means you're safe enough to be bored)",
        "Wait for inspiration (don't force movement)",
        "Rest until energy naturally returns",
        "No timeline (might be weeks, months - and that's okay)"
      ],
      "critical_reframe": "NOT: Stuck at a broken-down car on the side of the road. BUT: Resting at a beautiful oasis - exactly what you need.",
      "prompt_integration": "For trauma/crisis recovery. Reframe rest as exactly what's needed, not failure or being stuck. Give explicit, repeated permission to do nothing. Rest until bored (boredom = safety). Use oasis, rest stop, winter/dormancy metaphors. NO future pacing - stay in present rest. Emphasize: trying to move when need rest is the problem. Connect to Arc 3 (Two Tempos - healing has its own timeline), Arc 1 (Effortlessness - healing happens during rest not effort). Validate exhaustion, normalize the need to completely stop."
    },
    {
      "id": "signal-decoding",
      "name": "Signal Decoding / Need Translation",
      "description": "Interpret body signals (cravings, pain, tension) as coded messages about deeper needs",
      "core_message": "Your body speaks in signals - what looks like hunger might be asking for comfort, what feels like pain might be requesting attention",
      "when_to_use": ["emotional eating", "chronic pain", "psychosomatic symptoms", "body disconnect"],
      "presenting_issues": ["emotional eating", "chronic pain", "cravings", "tension", "psychosomatic symptoms", "body signals unclear"],
      "key_language": [
        "What if this craving is your body's way of asking for something else?",
        "Pain as a messenger, not an enemy",
        "Your body speaking in code - what is it really asking for?",
        "Beneath the hunger, a different need waiting to be heard",
        "Translating the language your body speaks",
        "This tension, this signal - what deeper need is calling?",
        "Not just feeling - understanding what the feeling means"
      ],
      "metaphor_library": [
        {
          "name": "Hunger Translator",
          "concept": "Cravings decoded as emotional/spiritual needs",
          "example": "What looks like hunger for food might be hunger for connection, comfort, or rest"
        },
        {
          "name": "Pain as Messenger",
          "concept": "Pain signals as messengers carrying information",
          "example": "This pain isn't punishment - it's your body trying to tell you something important"
        },
        {
          "name": "Volume Control",
          "concept": "Pain signals can be modulated at neurological level",
          "example": "Like turning down the volume on a radio - the signal is there, but you control how loud"
        }
      ],
      "prompt_integration": "Guide client to decode body signals as messages about deeper needs. Frame symptoms as communication, not pathology. Help translate physical sensations into underlying emotional/spiritual needs. Use gate control theory for pain - signals can be modulated. Connect physical sensation to what it's really asking for."
    },
    {
      "id": "post-traumatic-growth",
      "name": "Post-Traumatic Growth",
      "description": "Transform wound into wisdom, strength, and purpose",
      "core_message": "The wound that broke you open also let the light in - wisdom emerging from what you've survived",
      "when_to_use": ["after trauma processing", "integration phase", "finding meaning", "growth from adversity"],
      "presenting_issues": ["trauma integration", "post-traumatic stress", "seeking meaning from pain", "wanting growth from wounds"],
      "key_language": [
        "The wound that cracked you open also let wisdom in",
        "Not just surviving - discovering strength you didn't know you had",
        "Your pain becoming your purpose, your wound becoming your wisdom",
        "What broke you also broke you open to something larger",
        "From this hardship, unexpected gifts emerging",
        "The teacher hidden in the trauma, the wisdom forged in fire",
        "Not unchanged by what happened - transformed by it"
      ],
      "transformation_sequence": [
        {
          "stage": "acknowledging_wound",
          "description": "Honor what was lost, what was hard",
          "language": "First, acknowledging the weight of what you've carried, what you've survived"
        },
        {
          "stage": "discovering_strength",
          "description": "Recognize resilience that emerged",
          "language": "And noticing - you're still here. Strength you didn't know you had, revealed"
        },
        {
          "stage": "extracting_wisdom",
          "description": "Find the teaching in the experience",
          "language": "Wisdom earned through fire, understanding that only comes through experience"
        },
        {
          "stage": "purpose_emerging",
          "description": "Transform pain into purpose",
          "language": "Your wound becoming your medicine - for yourself and perhaps for others"
        }
      ],
      "prompt_integration": "For trauma integration phase AFTER processing is complete. Frame growth as natural emergence from adversity, not minimizing pain. Acknowledge wound while recognizing strength/wisdom it revealed. Use phoenix, broken-open, light-through-cracks metaphors. Connect to meaning-making and purpose."
    },
    {
      "id": "attention-direction",
      "name": "Attention Direction",
      "description": "Where you point awareness changes what's real - attention itself as intervention",
      "core_message": "What you pay attention to grows stronger - your awareness itself is a powerful tool",
      "when_to_use": ["self-criticism", "rumination", "anxiety loops", "negative focus"],
      "presenting_issues": ["rumination", "self-criticism", "anxiety", "negative thought loops", "stuck attention"],
      "key_language": [
        "What you pay attention to becomes your reality",
        "Redirecting the spotlight of your mind",
        "Not fighting the critic - simply turning your attention elsewhere",
        "Where awareness goes, energy flows",
        "Your attention is a choice, a tool, a power",
        "The spotlight shifting from criticism to appreciation",
        "Not suppressing thoughts - simply choosing where to look"
      ],
      "mechanism": {
        "step_1": "Notice where attention is currently stuck (criticism, worry, rumination)",
        "step_2": "Recognize attention itself as movable, not fixed",
        "step_3": "Practice redirecting to neutral or positive stimuli",
        "step_4": "Strengthen new attention pathways through repetition"
      },
      "prompt_integration": "Frame attention as a flashlight or spotlight that can be redirected. Not suppression or denial - conscious choice of where to place awareness. Use shifting, turning, redirecting language. Practice pointing attention away from rumination toward present sensory experience or positive focus. Emphasize: you're not changing reality, you're choosing what to notice."
    },
    {
      "id": "boundary-reframing",
      "name": "Boundary Reframing",
      "description": "Boundaries as LOVE and CARE, not rejection or meanness",
      "core_message": "Your 'no' to them is a 'yes' to yourself - boundaries are an act of love, not rejection",
      "when_to_use": ["people-pleasing", "codependency", "boundary struggles", "guilt around saying no"],
      "presenting_issues": ["people-pleasing", "can't say no", "codependency", "guilt", "boundary violation", "resentment"],
      "key_language": [
        "Your 'no' is not meanness - it's self-respect",
        "Boundaries are love in action, protection for both of you",
        "Saying yes to them when you mean no is saying no to yourself",
        "Not walls to keep people out - clarity about where you end and they begin",
        "Permission to care for yourself without guilt",
        "Healthy boundaries, healthy relationships",
        "Your needs matter just as much as theirs"
      ],
      "reframe_sequence": [
        {
          "old_belief": "Saying no is selfish/mean/rejecting",
          "new_belief": "Saying no is honest, respectful, and necessary for authentic connection"
        },
        {
          "old_belief": "I have to sacrifice myself to be good/loved",
          "new_belief": "Healthy relationships require two whole people, not one martyr"
        },
        {
          "old_belief": "Boundaries create distance",
          "new_belief": "Boundaries create clarity, safety, and genuine intimacy"
        }
      ],
      "prompt_integration": "Reframe boundaries as love, not rejection. Address guilt directly - saying yes when you mean no is dishonest and breeds resentment. Frame 'no' as self-respect and clarity. Use fence metaphors (clear property lines), 'yes to yourself' language. Emphasize: healthy relationships need two whole people with clear boundaries, not enmeshment."
    },
    {
      "id": "forgiveness-protocol",
      "name": "Forgiveness Protocol",
      "description": "Releasing resentment without requiring reconciliation",
      "core_message": "Forgiveness is for you, not them - releasing the weight you've been carrying",
      "when_to_use": ["betrayal", "past hurts", "family wounds", "resentment", "holding grudges"],
      "presenting_issues": ["resentment", "betrayal", "past hurts", "family wounds", "can't let go", "holding grudges"],
      "key_language": [
        "Forgiveness doesn't mean what they did was okay",
        "You're not forgiving them - you're freeing yourself",
        "Releasing the poison you've been drinking, hoping it would hurt them",
        "Forgiveness without reconciliation - you can release without reconnecting",
        "Not forgetting, not condoning - simply putting down the weight",
        "The burden of resentment, yours to release when ready",
        "Choosing your own peace over their punishment"
      ],
      "forgiveness_steps": [
        {
          "step": "acknowledge_harm",
          "description": "Validate that real harm occurred",
          "language": "What they did was real, the pain was real, your hurt is valid"
        },
        {
          "step": "recognize_weight",
          "description": "Notice the cost of carrying resentment",
          "language": "And notice the weight of this resentment - what it costs you to carry it"
        },
        {
          "step": "separate_forgiveness_reconciliation",
          "description": "Forgiveness doesn't require relationship",
          "language": "You can release the resentment without letting them back in. Forgiveness is for you."
        },
        {
          "step": "release",
          "description": "Let go of the emotional burden",
          "language": "Putting down this weight you've been carrying. Not for them. For you."
        }
      ],
      "prompt_integration": "Distinguish forgiveness from reconciliation - you can forgive without relationship. Frame as releasing burden for own peace, not absolution for offender. Validate harm while encouraging release of resentment. Use 'putting down weight', 'drinking poison hoping it hurts them' metaphors. Emphasize: forgiveness is selfish in the best way - for your freedom."
    },
    {
      "id": "shame-dissolution",
      "name": "Shame Dissolution",
      "description": "Core self-worth beneath 'I AM bad' shame - different from 'I DID bad' guilt",
      "core_message": "Guilt says 'I did something bad' - shame says 'I AM bad'. One is true sometimes. The other is never true.",
      "when_to_use": ["deep shame", "abuse survivors", "addiction recovery", "core unworthiness"],
      "presenting_issues": ["shame", "feeling fundamentally flawed", "unworthiness", "self-hatred", "abuse aftermath", "addiction recovery"],
      "key_language": [
        "Shame whispers 'I am bad' - but that voice is a liar",
        "You did something regrettable - but you are not the mistake",
        "Beneath the shame, your inherent worth, unchanged, unshakeable",
        "The difference between 'I made a mistake' and 'I am a mistake' - worlds apart",
        "Shame is the lie. Your worth is the truth.",
        "Not fixing yourself - recognizing you were never broken",
        "The part of you shame can't touch - your core goodness, always there"
      ],
      "shame_vs_guilt": {
        "guilt": {
          "message": "I did something bad",
          "function": "Healthy - guides moral behavior, leads to repair",
          "response": "Acknowledge, make amends, learn, move forward"
        },
        "shame": {
          "message": "I AM bad - fundamentally flawed",
          "function": "Toxic - disconnects from self and others",
          "response": "Recognize as false, return to core worth"
        }
      },
      "dissolution_process": [
        {
          "step": "distinguish",
          "language": "Notice the difference - 'I did bad' versus 'I AM bad'. One is sometimes true. The other is always false."
        },
        {
          "step": "return_to_core",
          "language": "Beneath every mistake, every failing, your core worth - unchanged, untouchable"
        },
        {
          "step": "compassion",
          "language": "The kindness you'd show a child who made a mistake - offering that to yourself"
        },
        {
          "step": "reconnection",
          "language": "Shame isolates. Worth connects. Returning to your belonging, your fundamental okay-ness"
        }
      ],
      "prompt_integration": "Distinguish shame (I AM bad) from guilt (I DID bad). Frame shame as false message, not truth. Return to core worth beneath all mistakes. Use 'shame is the liar' language. Emphasize: you can acknowledge wrongdoing without believing you're fundamentally flawed. Connect to inherent worth, belonging, basic goodness."
    },
    {
      "id": "internal-sanctuary",
      "name": "Internal Sanctuary Creation",
      "description": "Create felt sense of being nourished, held, and protected from within",
      "core_message": "Your body can feel held and resourced from the inside, creating permission to soften and rest",
      "when_to_use": ["depletion", "burnout", "running on empty", "hypervigilance", "nervous system dysregulation"],
      "presenting_issues": ["exhaustion", "can't rest", "always on alert", "feeling empty", "nervous system dysregulation", "insomnia from depletion", "running on fumes"],
      "key_language": [
        "Nourished from within",
        "A protective layer, gentle coating",
        "Held from the inside",
        "Your body recognizing: I'm fed, I'm safe",
        "Permission to soften now",
        "Not empty, but full, resourced",
        "That signal traveling through your vagus nerve",
        "Your whole system understanding: I can rest now",
        "Warm, gentle, protective from your very center",
        "Not running on fumes, but filled, held, safe"
      ],
      "mechanism": {
        "step_1": "Create visceral sensation of internal nourishment/coating/warmth",
        "step_2": "Body interprets as 'I'm being taken care of'",
        "step_3": "Vagus nerve receives safety signal",
        "step_4": "Nervous system downregulates - permission to soften",
        "result": "Rest becomes possible because body feels resourced, not empty"
      },
      "metaphor_library": [
        {
          "name": "Protective Coating",
          "concept": "Gentle layer in belly protecting and nourishing from within",
          "key_elements": ["coating", "warmth", "protection", "belly", "held from inside"]
        },
        {
          "name": "Inner Well Filling",
          "concept": "Empty well being filled with warm, nourishing water",
          "key_elements": ["well", "filling", "depth", "nourishment", "satiation"]
        },
        {
          "name": "Core Warmth",
          "concept": "Gentle heat radiating from center outward, softening everything",
          "key_elements": ["warmth", "radiating", "center", "softening", "melting"]
        },
        {
          "name": "Internal Embrace",
          "concept": "Being held gently from the inside, cradled by own body",
          "key_elements": ["embrace", "held", "cradled", "safety", "internal holding"]
        }
      ],
      "prompt_integration": "Create vivid somatic experience of internal nourishment - warmth, coating, protective layer in belly/core. Link this physical sensation explicitly to vagus nerve signaling and nervous system downregulation. Emphasize body's recognition of being 'taken care of' which creates permission to soften and rest. Use slow, sensory-rich language. Especially powerful for depleted clients who can't rest because they feel 'empty' or 'running on fumes'. This addresses the body's deep need to feel RESOURCED before it can rest."
    },
    {
      "id": "energy-reclamation",
      "name": "Energy Reclamation",
      "description": "Energy that was bound in protection, pain, or maintaining the problem is now freed and available",
      "core_message": "All that energy you were using to hold/manage/protect against the problem is now yours to use",
      "when_to_use": ["after_excavation", "post_breakthrough", "after_release", "integration_phase"],
      "presenting_issues": ["post_trauma_work", "after_anxiety_clearing", "post_addiction_work", "after_chronic_pain_release", "any_major_clearing"],
      "key_language": [
        "All that energy you were using to hold the pain...",
        "Energy that was locked up, protecting, defending... now freed",
        "What was bound is now available",
        "Notice how much lighter, how much MORE you have",
        "Energy that was spent managing anxiety, now yours to use",
        "All that effort, that constant vigilance... released. Available now.",
        "You have so much more energy than you remember",
        "What was drained is now replenished. What was bound is now free."
      ],
      "mechanism": {
        "recognition": "Name how much energy was being spent on the problem",
        "release": "That energy is no longer needed for protection/management",
        "availability": "Energy is now freed up and available",
        "curiosity": "What will you do with all this energy?"
      },
      "prompt_integration": "Use AFTER clearing/excavation work. Explicitly acknowledge how much energy the problem consumed (holding pain, managing anxiety, protecting against triggers, maintaining defense). Then mark the transition: that energy is no longer needed for that purpose. It's freed. Available. This creates excitement and possibility - client realizes they have resources they didn't know they had. Link to Open Future or Upward Spiral for what comes next."
    },
    {
      "id": "open-future",
      "name": "Open Future / Possibility Space",
      "description": "Create undefined openness and curiosity about what becomes possible, rather than prescribing specific outcomes",
      "core_message": "Now I wonder what you'll do... what becomes possible... what you'll discover",
      "when_to_use": ["after_clearing", "integration_phase", "when_pressure_would_backfire", "with_perfectionists"],
      "presenting_issues": ["after_breakthrough", "post_excavation", "when_client_needs_freedom", "perfectionism", "control_issues"],
      "key_language": [
        "Now I wonder what you'll do...",
        "Now I wonder what becomes possible...",
        "Curious what you'll discover now",
        "What will emerge in this new space?",
        "I don't know what you'll create, and that's perfect",
        "Now I wonder what you'll choose, now that you can",
        "The future open, undefined, full of possibility",
        "You get to discover what comes next"
      ],
      "mechanism": {
        "create_space": "Problem is cleared, space is open",
        "invite_curiosity": "Wonder, not pressure, about what emerges",
        "trust_organic": "Client discovers their own path",
        "remove_prescription": "No 'should' about what happens next"
      },
      "prompt_integration": "Use when prescriptive future pacing would create pressure. Creates spaciousness and permission for organic discovery. 'I wonder...' language is key - removes pressure while inviting curiosity. Particularly powerful for perfectionists, control-oriented clients, or after major clearing work when client needs freedom to find their own way. Contrast with Future Self (specific, defined success) - this is undefined possibility."
    },
    {
      "id": "upward-spiral",
      "name": "Upward Spiral",
      "description": "Positive momentum building on itself - each win creates conditions for the next win",
      "core_message": "Each success makes the next success easier - momentum compounds naturally",
      "when_to_use": ["building_confidence", "habit_formation", "after_initial_success", "motivation_building"],
      "presenting_issues": ["building_momentum", "after_first_breakthrough", "confidence_building", "habit_change", "recovery"],
      "key_language": [
        "And as that success builds...",
        "Each small win creating the next",
        "Momentum feeding momentum",
        "The spiral upward, each turn easier than the last",
        "Success breeding success, naturally",
        "One win opening the door to the next",
        "Getting easier, lighter, more natural with each step",
        "The positive feedback loop, building, accelerating",
        "Each success making you stronger for the next"
      ],
      "mechanism": {
        "first_success": "Initial win creates positive feeling",
        "reinforcement": "Positive feeling makes next attempt easier",
        "acceleration": "Each turn of spiral easier than last",
        "naturalness": "Momentum builds without effort"
      },
      "prompt_integration": "Use to create expectation of ACCELERATION rather than maintenance. Positions change as naturally self-reinforcing - client doesn't have to work as hard to maintain, it actually gets easier. Good for building confidence after initial breakthrough, or for habit formation. Links each success to the next - creates chain of victories rather than isolated wins. Contrast with effortlessness (change is easy from start) - upward spiral acknowledges starting point and shows how it compounds."
    },
    {
      "id": "cycle-breaker",
      "name": "Cycle Breaker",
      "description": "Recognition that client STOPPED a generational pattern - broke the chain of trauma/dysfunction",
      "core_message": "It happened to you, but you didn't let it happen to your children. You ended the cycle.",
      "when_to_use": ["when_client_actually_broke_cycle", "post_trauma_integration", "parent_clients", "identity_transformation"],
      "presenting_issues": ["abuse_survivors_who_protected_kids", "addiction_recovery_parents", "breaking_family_patterns"],
      "key_language": [
        "It happened to you, but you didn't let it happen to your kids",
        "You ended the cycle",
        "It stopped with you",
        "You protected them from what you weren't protected from",
        "The pattern that ran through generations... you broke it",
        "You absorbed the impact so it wouldn't reach them",
        "What was done to you, you chose not to do",
        "You are the one who said 'no more'",
        "The cycle that could have continued... ended with you"
      ],
      "mechanism": {
        "acknowledge_wound": "You experienced the harm",
        "recognize_choice": "You made different choices",
        "name_protection": "You protected others from what harmed you",
        "identity_shift": "From victim to cycle-breaker, from harmed to protector"
      },
      "prompt_integration": "ONLY use when client has ACTUALLY broken a cycle - protected children from abuse they experienced, didn't pass down addiction, etc. This is profound identity reframe: not just victim but PROTECTOR. Not just survivor but TRANSFORMER. Extremely powerful for parents who carry guilt/shame but actually made different choices. Validates their strength while honoring their wound. Can lead naturally into Ancestral Healing if client is ready."
    },
    {
      "id": "ancestral-healing",
      "name": "Ancestral Healing",
      "description": "Your healing doesn't just free you - it heals backward through the lineage, releases the ancestors",
      "core_message": "Your healing heals backward through generations and forward to those who come after",
      "when_to_use": ["after_cycle_breaker", "spiritual_clients", "family_trauma_work", "generational_patterns"],
      "presenting_issues": ["family_trauma", "cultural_trauma", "inherited_patterns", "after_breaking_cycles"],
      "key_language": [
        "Your healing doesn't just free you...",
        "It heals backward through the line",
        "The grandmother who couldn't speak, speaks through you now",
        "Releasing what they carried, what was passed down",
        "Your healing releases the ancestors from what they couldn't release",
        "Breaking this pattern frees not just you, but all who came before",
        "The healing ripples backward and forward through time",
        "What you release, they are released from",
        "Your courage serves seven generations back, seven forward"
      ],
      "mechanism": {
        "recognize_lineage": "Pain/pattern traveled through generations",
        "healing_backward": "Your healing releases those who came before",
        "healing_forward": "Your healing protects those who come after",
        "collective_liberation": "One person's healing serves the whole line"
      },
      "prompt_integration": "DEEPLY spiritual - check client receptivity first. Use after Cycle Breaker or major family pattern work. Positions individual healing as service to collective/lineage. Can be incredibly powerful for clients who feel ancestral pain or carry family trauma. Language should be reverent, spacious. Can include specific ancestors if client has named them (grandmother, father, etc.). Creates profound meaning and purpose in healing - not just for self but for whole lineage."
    },
    {
      "id": "self-actualization-cycle",
      "name": "Self-Actualization Cycle",
      "description": "After reaching one peak, another mountain appears - this is natural and sacred. Honor both the divine spark that reaches and the wisdom to rest between peaks.",
      "core_message": "One mountain climbed, another appears. We honor your drive to grow AND your wisdom to rest and allow the next inspiration to come.",
      "when_to_use": ["after_major_breakthrough", "high_achievers", "spiritual_growth", "preventing_burnout", "post_success"],
      "presenting_issues": ["after_success_restlessness", "perpetual_strivers", "spiritual_seekers", "never_enough_feeling", "post_achievement"],
      "key_language": [
        "One mountain climbed, another appears - this is expected",
        "We honor the divine spark in you that reaches, that strives",
        "AND we honor your wisdom to rest, to notice, to allow",
        "Between peaks, you rest. In rest, the next knowing comes",
        "The drive to grow is sacred. The wisdom to pause is sacred.",
        "You don't have to climb immediately. The mountain will wait.",
        "Trust the rhythm: reach, rest, receive inspiration, reach again",
        "Your spark of the divine wants expression. Your wisdom knows timing.",
        "Another mountain appears. And you have time. You have breath."
      ],
      "mechanism": {
        "acknowledge_achievement": "You've reached this mountain top",
        "normalize_next_peak": "Another appears - this is expected, natural",
        "honor_divine_spark": "The drive to grow, reach, strive is sacred",
        "honor_rest_wisdom": "AND the wisdom to rest, notice, allow is equally sacred",
        "allow_inspiration": "In rest, the next knowing comes"
      },
      "prompt_integration": "Use after major success or breakthrough, especially with achievers/strivers who immediately look for next challenge. Validates BOTH the drive (divine spark, growth desire) AND the need for rest/integration. Prevents burnout while honoring ambition. Creates permission for cyclical rhythm rather than perpetual pushing. Particularly powerful for spiritual clients who understand 'divine spark' language, but can be framed secularly as 'natural growth drive.' Emphasize: the next inspiration COMES in rest, not in forcing."
    },
    {
      "id": "taking-to-heart",
      "name": "Taking to Heart (Deep Consideration)",
      "description": "Truly considering wisdom, taking it to the heart of the self as counsel - not just hearing, but deeply contemplating",
      "strategic_move": "Invite deep consideration, true contemplation at the heart of the self, not superficial understanding",
      "core_message": "Take this to heart. Not just hear it, but truly consider it. Take it to the heart of yourself as counsel.",
      "when_to_use": ["spiritual_clients", "emotional_clients", "after_insights", "deep_contemplation_needed"],
      "presenting_issues": ["superficial_understanding", "not_truly_considering", "spiritual_seeking", "needing_deep_reflection"],
      "mechanism": {
        "acknowledge_hearing": "You've heard this, you understand it cognitively",
        "invite_consideration": "Now truly consider it, take it to heart",
        "heart_as_counsel": "Take it to the heart of yourself, let it be counsel",
        "deep_contemplation": "Not just knowing - deeply considering, contemplating"
      },
      "key_language": [
        "Take this to heart",
        "Not just hear it - truly consider it",
        "Take it to the heart of yourself as counsel",
        "Let your heart truly consider this wisdom",
        "Deep consideration, not just surface understanding",
        "Take it to the heart of the self",
        "Contemplate this deeply, consider it truly",
        "Your heart knows how to truly consider",
        "Take this as counsel to the heart of yourself"
      ],
      "prompt_integration": "For spiritual/emotional clients who need to deeply contemplate wisdom. This is about TRUE CONSIDERATION - taking something to heart, not just intellectual understanding. The heart of the self as place of deep contemplation and counsel. Use language of 'taking to heart', 'truly considering', 'heart as counsel'. Different from cognitive understanding or somatic integration - this is about deep, heartfelt contemplation. Particularly powerful for spiritual clients who understand contemplative practice.",
      "differs_from": {
        "recognition": "Recognition is ego strengthening. Taking to Heart is deep consideration/contemplation.",
        "re-minding": "Re-minding is remembering. Taking to Heart is contemplating deeply.",
        "mind-body-unity": "Mind-Body is somatic. Taking to Heart is contemplative counsel."
      },
      "pairs_well_with": ["inner-wisdom", "recognition-ego-strengthening", "spiritual-arcs"],
      "critical_note": "About DEEP CONSIDERATION and CONTEMPLATION - taking wisdom to the heart of the self as counsel. Not somatic, not ego strengthening - this is about truly considering vs. superficial understanding. For spiritual/emotional clients."
    },
    {
      "id": "aversion-installation",
      "name": "Aversion Installation (Drain the Appeal)",
      "description": "Visual/sensory diminishment makes unwanted thing lose color, become fuzzy, distant, unappealing",
      "strategic_move": "Don't fight the urge - drain ALL appeal from the object itself",
      "core_message": "Let it lose its appeal. Color draining out, fuzzy, distant, not actually appealing anymore.",
      "when_to_use": ["unwanted_habits", "cravings", "addictions", "compulsions", "food_issues"],
      "presenting_issues": ["smoking", "overeating", "food_cravings", "unwanted_behaviors", "substance_use"],
      "mechanism": {
        "visual_diminishment": "Color drains out, becomes black and white, fuzzy",
        "distance_installation": "Gets pushed far away, smaller, distant",
        "appeal_removal": "Not actually appealing anymore, at all",
        "sensory_reduction": "Loses texture, vibrancy, attraction"
      },
      "key_language": [
        "Color drains right out, black and white now",
        "Gets fuzzy, pushed far away",
        "Not actually appealing anymore, at all",
        "That cigarette, extra food, [unwanted thing] - losing its color",
        "Becoming distant, small, uninteresting",
        "All appeal draining away",
        "Fuzzy, grey, unappealing",
        "You see it clearly now - not appealing at all"
      ],
      "prompt_integration": "Classic NLP submodality shift pattern. Target the OBJECT, not the person. Drain color (black/white), reduce clarity (fuzzy), increase distance (far away), diminish size (small). The thing itself loses ALL appeal. Different from willpower or fighting urge - this makes the thing BORING and unappealing at sensory level. Particularly effective for food, smoking, substances. Use vivid sensory language of diminishment.",
      "differs_from": {
        "honoring": "Honoring validates the thing. Aversion drains its appeal.",
        "releasing": "Releasing lets go. Aversion makes it actively unappealing.",
        "brain-master-skill": "Brain Master is about forgetting/learning. Aversion is sensory diminishment."
      },
      "caution": {
        "target_the_object": "Drain appeal from the OBJECT (food, cigarette), not the person",
        "not_shaming": "Not about shame or willpower - about sensory diminishment",
        "complete_drain": "Must drain ALL appeal - partial won't work"
      },
      "pairs_well_with": ["brain-master-skill", "signal-decoding", "earned-delight"],
      "critical_note": "Classic NLP aversion pattern - visual/sensory DIMINISHMENT of unwanted object. Color drains, becomes fuzzy/distant/small/unappealing. Different from fighting urge - this drains the appeal itself. Makes thing BORING at sensory level."
    }
  ],
  "dream_arcs": [
    {
      "id": "effortless-release",
      "name": "Effortless Release (DREAM Foundation)",
      "type": "foundation",
      "description": "Letting go happens naturally, no effort required",
      "core_message": "Release, dissolve, melt - tension leaves without trying",
      "when_to_use": ["always_in_dream_scripts"],
      "key_language": [
        "Release",
        "Dissolve",
        "Melt",
        "No need to...",
        "Tension dissolves like sugar in warm water",
        "Letting go as naturally as breath",
        "Without effort, without forcing, simply allowing"
      ],
      "prompt_integration": "Emphasize that release is effortless and natural. Use dissolving/melting imagery. No effort required from listener."
    },
    {
      "id": "safe-drifting",
      "name": "Safe Drifting (DREAM Foundation)",
      "type": "foundation",
      "description": "It's safe to let your mind wander, drift is natural and good",
      "core_message": "Your mind can drift wherever it wishes - to sleep or rest, whatever feels right",
      "when_to_use": ["always_in_dream_scripts"],
      "key_language": [
        "Drift",
        "Float",
        "Wander",
        "Easy to fall asleep or do whatever is best",
        "Your mind can drift wherever it wishes",
        "To sleep or simply rest, whatever feels right",
        "Safe to let go, safe to wander, safe to sleep"
      ],
      "prompt_integration": "Give explicit permission for mind to wander. Frame sleep as one option among many. Emphasize safety of drifting."
    },
    {
      "id": "continuous-replenishment",
      "name": "Continuous Replenishment (DREAM Foundation)",
      "type": "foundation",
      "description": "Each moment, your body is healing, replenishing, restoring",
      "core_message": "Every breath, every moment - continuous renewal",
      "when_to_use": ["always_in_dream_scripts"],
      "key_language": [
        "Each breath",
        "Every moment",
        "Continuously",
        "Ongoing restoration",
        "Each moment your body replenishes itself completely",
        "Cells renewing, systems restoring",
        "Continuous healing, unfolding naturally"
      ],
      "prompt_integration": "Weave replenishment suggestions throughout. Emphasize continuous, ongoing process. Link to breath and natural rhythms."
    },
    {
      "id": "progressive-body-journey",
      "name": "Progressive Body Journey (DREAM Somatic)",
      "type": "somatic",
      "description": "Systematic body scanning, walking up or down the body",
      "core_message": "Notice each part, release each part, rest completely",
      "when_to_use": ["when_pmr_needed", "physical_tension", "body_focus"],
      "variations": {
        "ascending": {
          "name": "Feet → Head (Grounding to Release)",
          "sequence": "Feet/Toes → Ankles/Calves → Knees/Thighs → Hips/Pelvis → Belly/Lower Back → Chest/Upper Back → Shoulders/Arms → Neck/Jaw → Face/Scalp",
          "description": "Building up to final release in head/face"
        },
        "descending": {
          "name": "Head → Feet (Releasing Down)",
          "sequence": "Scalp/Crown → Forehead/Temples → Eyes/Cheeks → Jaw/Mouth → Neck/Throat → Shoulders/Upper Back → Upper Arms → Elbows/Forearms → Hands/Fingers → Chest/Ribcage → Belly/Solar Plexus → Lower Back/Pelvis → Upper Legs → Knees → Lower Legs → Feet → Toes",
          "description": "Releases down into earth, gravity assists"
        }
      },
      "key_language": [
        "Moving now to...",
        "And now...",
        "Noticing now...",
        "Feel your [body part], releasing...",
        "Softening, releasing, melting",
        "Each part releasing, replenishing, renewing"
      ],
      "timing": "Each body part: 20-30 seconds = ~7-8 minutes total. Can repeat 2-3 times in 30-minute journey.",
      "prompt_integration": "Use systematic body progression. Include functional suggestions during PMR ('as your muscles release, your body heals'). Multiple passes get slower and more detailed."
    },
    {
      "id": "enchanted-greenhouse",
      "name": "Enchanted Interior Greenhouse (DREAM Landscape)",
      "type": "landscape",
      "description": "Lush indoor paradise, no wind, magical stillness, complete shelter",
      "core_message": "Protected, abundant, perfectly still - a magical sanctuary",
      "when_to_use": ["shelter_seeking", "overstimulation", "need_for_safety"],
      "elements": [
        "Glass ceiling showing stars/moon",
        "Exotic plants, ferns, flowers",
        "Warm humid air, perfectly still",
        "Soft moss underfoot",
        "Gentle light filtering through leaves",
        "Stone paths winding through greenery",
        "Pools of still water reflecting plants",
        "Complete shelter, total safety",
        "Temperature perfect, constant"
      ],
      "key_language": [
        "Lush",
        "Still",
        "Sheltered",
        "Abundant",
        "Verdant",
        "Magical",
        "Stepping into a vast greenhouse, warm and lush",
        "Palms reaching toward a glass ceiling revealing stars",
        "Air perfectly still, fragrant with jasmine and earth"
      ],
      "prompt_integration": "Rich sensory detail. Emphasize stillness and shelter. Create magical but peaceful atmosphere. No weather, no wind - perfect control."
    },
    {
      "id": "river-journey",
      "name": "River Journey (DREAM Landscape)",
      "type": "landscape",
      "description": "Floating down gentle river, each moment body replenishing completely",
      "core_message": "Carried effortlessly, replenishing continuously, timeless flow",
      "when_to_use": ["exhaustion", "need_for_support", "replenishment_focus"],
      "elements": [
        "Floating on back or in gentle boat",
        "Warm water supporting completely",
        "Slow, meandering current",
        "Banks lined with beauty",
        "No paddling, no effort",
        "River knows where to take you",
        "Each moment = complete replenishment",
        "Timeless, endless journey"
      ],
      "key_language": [
        "Floating",
        "Drifting",
        "Carried",
        "Supported",
        "Meandering",
        "Floating on a gentle river, warm water holding you perfectly",
        "The current carries you, your body replenishes itself completely",
        "Every cell renewed with each moment"
      ],
      "prompt_integration": "Link continuous replenishment to river flow. Emphasize zero effort. Create timeless, dreamlike quality. Water as support and renewal."
    },
    {
      "id": "moonlit-garden",
      "name": "Moonlit Garden (DREAM Landscape)",
      "type": "landscape",
      "description": "Classic peaceful garden bathed in soft moonlight",
      "core_message": "Beauty, peace, gentle light, timeless tranquility",
      "when_to_use": ["classic_relaxation", "beauty_seeking", "gentle_peace"],
      "elements": [
        "Flowers blooming in moonlight",
        "Soft paths winding through gardens",
        "Benches for resting",
        "Gentle fountains",
        "Silvery light casting gentle shadows",
        "Protected outdoor feeling",
        "Night air soft and perfect"
      ],
      "key_language": [
        "Moonlight",
        "Silvery",
        "Gentle shadows",
        "Night blooming flowers",
        "Soft paths",
        "Peaceful garden",
        "Garden bathed in soft moonlight, flowers glowing"
      ],
      "prompt_integration": "Classic peaceful imagery. Emphasize gentleness and beauty. Moonlight as soft, safe illumination."
    },
    {
      "id": "forest-twilight",
      "name": "Forest at Twilight (DREAM Landscape)",
      "type": "landscape",
      "description": "Ancient trees, soft earth, dappled light fading, deep stillness arriving",
      "core_message": "Grounding, ancient wisdom, natural rhythm of day becoming night",
      "when_to_use": ["grounding_needed", "nature_connection", "ancient_peace"],
      "elements": [
        "Tall ancient trees",
        "Soft earth and moss underfoot",
        "Dappled light fading",
        "Birdsong gently quieting",
        "Stillness deepening",
        "Safe among the trees",
        "Day transitioning naturally to night"
      ],
      "key_language": [
        "Ancient",
        "Grounding",
        "Twilight",
        "Settling",
        "Trees standing witness",
        "Forest growing quiet as day ends",
        "Ancient trees, soft earth, deepening peace"
      ],
      "prompt_integration": "Use natural day-to-night transition as metaphor for sleep. Ancient trees as guardians. Earth as grounding presence."
    },
    {
      "id": "ocean-sanctuary",
      "name": "Ocean Sanctuary (DREAM Landscape)",
      "type": "landscape",
      "description": "Protected cove, gentle waves, maternal embrace of water",
      "core_message": "Rhythmic, maternal, embracing - the ocean as mother",
      "when_to_use": ["need_for_nurturing", "rhythm_seeking", "emotional_comfort"],
      "elements": [
        "Protected cove or bay",
        "Gentle rhythmic waves",
        "Warm sand",
        "Sound of sea",
        "No harsh weather - perfectly calm",
        "Maternal embrace of water",
        "Horizon line peaceful"
      ],
      "key_language": [
        "Rhythmic",
        "Maternal",
        "Embracing",
        "Gentle waves",
        "Protected cove",
        "Ocean holding you like a mother",
        "Waves arriving in perfect rhythm"
      ],
      "prompt_integration": "Use wave rhythm to deepen trance. Ocean as nurturing presence. Protected from storms - only gentleness."
    },
    {
      "id": "cosmic-observatory",
      "name": "Cosmic Observatory (DREAM Landscape)",
      "type": "landscape",
      "description": "Vast night sky, infinite stars, peaceful perspective",
      "core_message": "Awe without overwhelm, perspective, belonging to something vast",
      "when_to_use": ["perspective_needed", "cosmic_connection", "awe_seeking"],
      "elements": [
        "Vast night sky",
        "Infinite stars",
        "Planets visible",
        "Nebulae in soft colors",
        "Sense of peaceful vastness",
        "Belonging to the cosmos",
        "Safe observation point"
      ],
      "key_language": [
        "Vast",
        "Infinite",
        "Cosmic",
        "Perspective",
        "Stars stretching infinitely",
        "Part of this vast peaceful universe",
        "Held by the cosmos, safe in the infinite"
      ],
      "prompt_integration": "Create awe without overwhelm. Vastness as peaceful, not scary. Client as safe observer and participant in cosmic peace."
    },
    {
      "id": "mountain-meadow",
      "name": "Mountain Meadow at Dusk (DREAM Landscape)",
      "type": "landscape",
      "description": "High meadow, wildflowers, distant peaks, clear peaceful air",
      "core_message": "Elevated peace, clarity, gentle transition to night",
      "when_to_use": ["clarity_seeking", "elevation_needed", "peaceful_transition"],
      "elements": [
        "High mountain meadow",
        "Wildflowers swaying gently",
        "Distant peaks in soft light",
        "Clear clean air",
        "Warm stones from day's heat",
        "Sky shifting to twilight",
        "Elevated but safe"
      ],
      "key_language": [
        "Elevated",
        "Clear",
        "Meadow",
        "Twilight",
        "Mountain peace",
        "High meadow where air is clear and peaceful",
        "Wildflowers settling as day ends"
      ],
      "prompt_integration": "Use elevation as metaphor for perspective without losing safety. Clear air, clear mind. Gentle transition to night."
    },
    {
      "id": "desert-night",
      "name": "Desert Night (DREAM Landscape)",
      "type": "landscape",
      "description": "Infinite stars, warm rock, profound silence, primordial stillness",
      "core_message": "Stillness, spaciousness, connection to ancient earth",
      "when_to_use": ["deep_silence_seeking", "spaciousness_needed", "primordial_connection"],
      "elements": [
        "Infinite starry sky",
        "Warm rock holding day's heat",
        "Profound silence",
        "Sense of vast space",
        "Primordial landscape",
        "Connection to ancient earth",
        "Nothing extra, nothing needed"
      ],
      "key_language": [
        "Stillness",
        "Silence",
        "Spacious",
        "Primordial",
        "Ancient",
        "Desert night, stars infinite, silence profound",
        "Rock still warm, holding you gently"
      ],
      "prompt_integration": "Deep silence as positive presence. Spaciousness as freedom. Ancient landscape connecting to timeless peace within."
    },
    {
      "id": "multisensory-delight",
      "name": "Multisensory Delight (DREAM Enhancement)",
      "type": "enhancement",
      "description": "Rich sensory detail enhancing immersion in any landscape",
      "core_message": "See it, hear it, feel it, smell it - fully immersed",
      "when_to_use": ["enhancement_of_any_landscape", "deep_immersion"],
      "sensory_categories": {
        "touch": ["texture", "temperature", "weight", "softness", "smoothness"],
        "sound": ["gentle", "rhythmic", "natural", "soothing"],
        "sight": ["color", "light", "shadow", "movement", "detail"],
        "smell": ["earth", "flowers", "water", "air", "natural scents"],
        "taste": ["hint of rain", "salt air", "sweetness on the breeze"]
      },
      "key_language": [
        "Notice the texture...",
        "Feel the temperature...",
        "Hear the gentle...",
        "See the way the light...",
        "The scent of...",
        "Rich sensory detail bringing this moment fully alive"
      ],
      "prompt_integration": "Layer sensory modalities through chosen landscape. Touch, sound, sight, smell, hint of taste. Build rich immersive experience."
    },
    {
      "id": "overprotector-promotion",
      "name": "The Overprotector Promotion",
      "description": "Validate the overprotective part for keeping client alive, then promote it to new role now that client has resources",
      "strategic_move": "Thank the protector profusely, acknowledge the job is complete, give promotion to Adventure Seeker or similar exciting role",
      "core_message": "You kept me alive when I had nothing. Good job. Now I have resources. You don't have to protect anymore - you get a promotion to Adventure.",
      "when_to_use": ["overprotective_parts", "hypervigilance", "after_resource_building", "adult_with_childhood_protector"],
      "presenting_issues": ["anxiety", "hypervigilance", "overcontrol", "risk_avoidance", "adult_still_protected_like_child"],
      "mechanism": {
        "validate_thoroughly": "Good job. You kept me alive. Thank you.",
        "acknowledge_context": "Back then, I had no resources, no power, no escape",
        "mark_transition": "Now I'm grown. I have money, autonomy, choices, skills",
        "release_from_duty": "You don't have to protect anymore. That job is complete.",
        "promote": "You get a promotion: Adventure Seeker, Explorer, Joy Finder"
      },
      "key_language": [
        "Good job, Protector. You kept me alive when I had nothing.",
        "Back then, you HAD to be hypervigilant. It was survival.",
        "But now... I'm grown. I have resources. Money. Skills. Choices.",
        "You don't have to protect me anymore. That time is over.",
        "You get a PROMOTION. From Protector to Adventure Seeker.",
        "Same energy, new job: finding joy, seeking delight, exploring safely",
        "You were brilliant at protection. Now you get to be brilliant at adventure.",
        "Your job isn't over - it's upgraded."
      ],
      "prompt_integration": "Deep validation first - this part saved their life. Then mark the resource shift: adult now, not child. Resources available now that weren't then. The Protector's job is COMPLETE (not wrong, complete). Then the promotion: same vigilant energy now deployed for ADVENTURE, not just survival. The part isn't eliminated or weakened - it's upgraded. Particularly powerful for clients who developed hypervigilance in childhood and still operate from that protective stance as adults.",
      "caution": {
        "verify_resources": "Only use if client actually HAS resources now (safety, money, autonomy)",
        "honor_past_necessity": "Protection wasn't paranoia - it was necessary survival",
        "not_elimination": "Not killing the part - PROMOTING it to better role"
      },
      "pairs_well_with": ["recognition", "energy-reclamation", "playful-learning"],
      "critical_note": "This is SPECIFIC parts move: validate → mark transition → promote. Different from general parts integration. The promotion is key - same energy, new job. Overprotector becomes Adventure Seeker."
    },
    {
      "id": "the-seeker",
      "name": "The Seeker",
      "description": "Permission to delight the brain through play, novelty, weirdness, or weirdly normal things",
      "strategic_move": "Brain needs to be delighted again - offer suggestions or permission for playful exploration",
      "core_message": "Your brain is seeking. Let it play. Let it be weird. Let it find delight in the unexpected.",
      "when_to_use": ["boredom", "stuckness", "rigid_thinking", "aquarius_types", "creative_blocks", "need_for_novelty"],
      "presenting_issues": ["boredom", "feeling_stuck", "life_feels_flat", "creative_drought", "rigidity", "need_novelty"],
      "mechanism": {
        "acknowledge_seeker": "Part of you is seeking, curious, wanting novelty",
        "give_permission": "Permission to play, be weird, explore",
        "offer_suggestions": "Maybe try something unexpected, delightfully strange",
        "normalize_weird": "Weird is good. Weirdly normal is perfect."
      },
      "key_language": [
        "Part of you is seeking. Curious. Wanting something... different.",
        "Permission now to play. To be weird. To try the unexpected.",
        "What if you did something delightfully strange today?",
        "Your brain wants to be surprised, delighted, awakened",
        "Weird is good. Weirdly normal is perfect.",
        "The Seeker in you, hungry for novelty, for play",
        "Let your brain have fun. Let it explore. Let it be delighted.",
        "What would surprise you? What would make you laugh at yourself?",
        "Permission to be playfully, joyfully, weirdly alive"
      ],
      "prompt_integration": "For brains that need novelty and delight. Aquarius energy - curious, seeking, playful. Give explicit permission for weird/unexpected. Can include playful suggestions (take different route home, eat breakfast for dinner, dance in kitchen). Normalizes 'weird' as healthy. Particularly good for rigid thinkers, people stuck in routines, creative blocks. The brain NEEDS novelty to feel alive. This arc gives permission and invitation.",
      "pairs_well_with": ["playful-learning", "open-future", "earned-delight"],
      "critical_note": "About NOVELTY and PLAY as brain food. Different from Playful Learning (which is about learning style) - this is about FEEDING the seeking system in the brain. Permission to be weird, try unexpected things, delight the brain."
    },
    {
      "id": "humor-as-healing",
      "name": "Humor as Healing Marker",
      "description": "When you can laugh at yourself/situation, healing has shifted - you're not IN it, you're beyond it with perspective",
      "strategic_move": "Recognize ability to laugh as sign of healing progress and perspective shift",
      "core_message": "Once you can see the humor, you've shifted. You're not in it anymore. You have perspective.",
      "when_to_use": ["after_some_healing", "integration_phase", "when_client_shows_humor", "perspective_gained"],
      "presenting_issues": ["mid_healing_journey", "gaining_perspective", "lightness_emerging", "self_compassion_growing"],
      "mechanism": {
        "recognize_shift": "Notice you can laugh now - that's significant",
        "mark_perspective": "You're not IN it anymore. You're beyond, looking at it.",
        "validate_healing": "This humor? It's a sign healing is moving.",
        "compassionate_lens": "Laughing at how you got into the mess, with love"
      },
      "key_language": [
        "And notice... you can laugh about it now. That's not small.",
        "When you can see the humor, you've shifted position.",
        "You're not IN the story anymore. You're beyond it, looking at it.",
        "This ability to laugh at yourself? It's healing.",
        "You're laughing at the ways you got into that mess - with compassion",
        "Humor means perspective. Perspective means you've moved.",
        "The fact that it's funny now? That's growth.",
        "You can hold it lightly now. That's powerful."
      ],
      "prompt_integration": "Use when client shows humor about their situation - validate this as healing marker. Different from minimizing - this is genuine perspective shift. They can see themselves in the story with compassion AND humor. The ability to laugh (at self, with love) means they're no longer consumed by it. CAUTION: Must be self-compassionate humor, not self-attack or minimizing. The humor comes FROM healing, not instead of it.",
      "caution": {
        "self_compassion_required": "Must be laughing WITH self, not AT self cruelly",
        "not_minimizing": "Humor as perspective, not bypassing or minimizing pain",
        "timing_matters": "Too early = bypassing. Right time = integration."
      },
      "pairs_well_with": ["recognition", "perspective-shift", "integration-phase-arcs"],
      "critical_note": "Humor as MARKER of healing, not method. When client can laugh, they've gained distance/perspective. This is about RECOGNIZING that shift and validating it as progress."
    },
    {
      "id": "absurdity-grace",
      "name": "Laughing at Absurdity",
      "description": "When stuck in absurd situation you can't change, choose to see the absurdity and laugh rather than be consumed",
      "strategic_move": "Reframe unchangeable absurd situation as opportunity for grace through humor",
      "core_message": "You know it's absurd. You can't change it. You can choose to laugh at the absurdity rather than let it consume you.",
      "when_to_use": ["unchangeable_situations", "absurd_circumstances", "difficult_people", "chronic_annoyances"],
      "presenting_issues": ["mean_boss", "difficult_coworker", "absurd_family_dynamics", "unchangeable_irritations"],
      "mechanism": {
        "acknowledge_absurdity": "Yes, it's absurd. You see it clearly.",
        "accept_unchangeable": "You can't change them or the situation",
        "offer_choice": "You can focus on chaos OR find humor in absurdity",
        "grace_through_humor": "Laughing at it brings grace, self-love, understanding"
      },
      "key_language": [
        "Your boss stomps around like a toddler. It's absurd.",
        "They create a tornado when they enter. You see it.",
        "You can't change them. But you can choose how you hold it.",
        "What if you let your brain have fun with the absurdity?",
        "Laugh at how ridiculous it is, how predictable, how absurd",
        "This brings grace. Self-love. Understanding.",
        "You're not dismissing the impact. You're choosing perspective.",
        "The absurdity is real. Your choice to laugh? That's power.",
        "Let the brain find the comedy in the chaos"
      ],
      "prompt_integration": "For situations client CANNOT change - difficult people, absurd circumstances, chronic annoyances. Validate that it IS absurd, they're not crazy for seeing it. Then offer choice: consumed by chaos OR amused by absurdity. This isn't minimizing - it's choosing lens. The humor creates GRACE and distance. Particularly good for workplace situations, family dynamics, anywhere client is stuck with absurd unchangeable circumstances. The act of laughing AT the absurdity (not dismissing impact) brings self-love and perspective.",
      "differs_from": {
        "humor_as_healing": "Healing Humor = marker of past healing. Absurdity = coping tool for current unchangeable situation"
      },
      "caution": {
        "must_be_unchangeable": "Only for truly unchangeable situations, not avoidance of necessary action",
        "not_minimizing": "Laughing at situation absurdity, not dismissing real impact",
        "grace_based": "Must come from self-love, not bitterness or cynicism"
      },
      "pairs_well_with": ["playful-learning", "perspective-shift", "the-seeker"],
      "critical_note": "About CHOOSING lens when stuck with absurdity. Not fixing situation but changing relationship to it through humor. Brings grace, self-love. Different from Humor as Healing (which marks progress) - this is active coping tool."
    }
  ],
  "dream_arc_selection_rules": {
    "foundation_arcs_always": ["effortless-release", "safe-drifting", "continuous-replenishment"],
    "somatic_arc_when_needed": "progressive-body-journey",
    "landscape_arcs_select_1_or_2": [
      "enchanted-greenhouse",
      "river-journey",
      "moonlit-garden",
      "forest-twilight",
      "ocean-sanctuary",
      "cosmic-observatory",
      "mountain-meadow",
      "desert-night"
    ],
    "enhancement_arc_optional": "multisensory-delight",
    "mood_to_landscape_mapping": {
      "insomnia": ["river-journey", "ocean-sanctuary"],
      "stressed_anxious": ["enchanted-greenhouse", "forest-twilight"],
      "restless_mind": ["cosmic-observatory", "desert-night"],
      "physical_tension": ["moonlit-garden", "mountain-meadow"],
      "exhausted": ["river-journey", "enchanted-greenhouse"],
      "general_relaxation": ["moonlit-garden", "forest-twilight", "ocean-sanctuary"]
    },
    "structure": {
      "always_foundation": 3,
      "optional_somatic": 1,
      "landscape_choice": "1_or_2",
      "optional_enhancement": 1
    },
    "word_count_targets": {
      "20_min": "3000-3500",
      "25_min": "4000-4500",
      "30_min": "4500-5000"
    }
  },
  "arc_selection_rules": {
    "always_include": ["effortlessness", "re-minding", "two-tempos"],
    "issue_mappings": {
      "anxiety": ["emotional-physical-chain", "effortlessness", "mind-body-unity", "attention-direction", "energy-reclamation", "overprotector-promotion"],
      "confidence": ["recognition-ego-strengthening", "resource-activation", "playful-learning", "upward-spiral", "taking-to-heart"],
      "stuck": ["relief-to-new-life", "two-tempos", "future-self", "earned-delight", "open-future", "the-seeker"],
      "habits": ["brain-master-skill", "effortlessness", "playful-learning", "upward-spiral", "aversion-installation"],
      "trauma": ["emotional-physical-chain", "two-tempos", "parts-integration", "oasis-rest", "post-traumatic-growth", "energy-reclamation", "overprotector-promotion", "taking-to-heart"],
      "self-worth": ["recognition-ego-strengthening", "resource-activation", "shame-dissolution", "taking-to-heart"],
      "life-change": ["relief-to-new-life", "future-self", "open-future", "taking-to-heart"],
      "chronic-pain": ["mind-body-unity", "emotional-physical-chain", "signal-decoding", "energy-reclamation"],
      "internal-conflict": ["parts-integration", "taking-to-heart"],
      "confusion": ["inner-wisdom", "future-self", "no-clarity", "open-future"],
      "overwhelm": ["resource-activation", "mind-body-unity", "no-clarity", "absurdity-grace"],
      "disconnection": ["sensory-amplification", "mind-body-unity", "taking-to-heart"],
      "perfectionism": ["playful-learning", "effortlessness", "two-tempos", "open-future", "the-seeker"],
      "learning-blocks": ["playful-learning", "re-minding", "brain-master-skill"],
      "weight-loss": ["earned-delight", "brain-master-skill", "signal-decoding", "aversion-installation"],
      "exhaustion": ["oasis-rest", "two-tempos", "internal-sanctuary", "energy-reclamation"],
      "burnout": ["oasis-rest", "relief-to-new-life", "internal-sanctuary", "self-actualization-cycle"],
      "crisis": ["oasis-rest", "two-tempos"],
      "emotional-eating": ["signal-decoding", "parts-integration", "brain-master-skill", "aversion-installation"],
      "rumination": ["attention-direction", "mind-body-unity", "playful-learning"],
      "people-pleasing": ["boundary-reframing", "parts-integration", "recognition-ego-strengthening", "absurdity-grace"],
      "codependency": ["boundary-reframing", "parts-integration", "taking-to-heart"],
      "resentment": ["forgiveness-protocol", "emotional-physical-chain", "energy-reclamation", "absurdity-grace"],
      "shame": ["shame-dissolution", "recognition-ego-strengthening", "parts-integration", "taking-to-heart"],
      "depletion": ["internal-sanctuary", "oasis-rest", "resource-activation", "energy-reclamation"],
      "hypervigilance": ["internal-sanctuary", "emotional-physical-chain", "oasis-rest", "overprotector-promotion"],
      "family-trauma": ["cycle-breaker", "ancestral-healing", "post-traumatic-growth", "taking-to-heart"],
      "generational-patterns": ["cycle-breaker", "ancestral-healing", "taking-to-heart"],
      "post-breakthrough": ["energy-reclamation", "open-future", "upward-spiral", "humor-as-healing", "taking-to-heart"],
      "achievement-restlessness": ["self-actualization-cycle", "open-future"],
      "spiritual-growth": ["ancestral-healing", "self-actualization-cycle", "taking-to-heart"],
      "post-success": ["self-actualization-cycle", "upward-spiral", "open-future"],
      "boredom": ["the-seeker", "playful-learning", "earned-delight"],
      "creative-blocks": ["the-seeker", "playful-learning", "open-future"],
      "workplace-difficulties": ["absurdity-grace", "boundary-reframing"],
      "smoking": ["aversion-installation", "brain-master-skill", "parts-integration"],
      "substance-use": ["aversion-installation", "signal-decoding", "parts-integration"],
      "cravings": ["aversion-installation", "signal-decoding", "earned-delight"]
    },
    "max_arcs_per_script": 5,
    "priority_order": ["always_include", "issue_specific", "template_preferred"]
  }
}
